Revit 2027 API
BuiltInFailures.StairRampFailures.InvalidRailProfile Property
 Profiles for one or more of the Rails are invalid. Make sure that every used Profile is a closed series of non-intersecting Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRailProfile { get; }
Public Shared ReadOnly Property InvalidRailProfile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRailProfile {
	FailureDefinitionId^ get ();
}
static member InvalidRailProfile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace